hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
/**
    Copyright (c) 2016 - 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/
#include "sdk_common.h"
#if NRF_MODULE_ENABLED(USBD)

#include "nrf_drv_usbd.h"
#include "nrf.h"
#include "nrf_atomic.h"
#include "app_util_platform.h"
#include "nrf_delay.h"

#include <stdbool.h>
#include <string.h>
#include <inttypes.h>

#define NRF_LOG_MODULE_NAME USBD

#if USBD_CONFIG_LOG_ENABLED
    #define NRF_LOG_LEVEL       USBD_CONFIG_LOG_LEVEL
    #define NRF_LOG_INFO_COLOR  USBD_CONFIG_INFO_COLOR
    #define NRF_LOG_DEBUG_COLOR USBD_CONFIG_DEBUG_COLOR
#else //USBD_CONFIG_LOG_ENABLED
    #define NRF_LOG_LEVEL       0
#endif //USBD_CONFIG_LOG_ENABLED
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#ifndef NRF_DRV_USBD_EARLY_DMA_PROCESS
    /*  Try to process DMA request when endpoint transmission has been detected
    and just after last EasyDMA has been processed.
    It speeds up the transmission a little (about 10% measured)
    with a cost of more CPU power used.
    */
    #define NRF_DRV_USBD_EARLY_DMA_PROCESS 1
#endif

#ifndef NRF_DRV_USBD_PROTO1_FIX_DEBUG
    /* Debug information when events are fixed*/
    #define NRF_DRV_USBD_PROTO1_FIX_DEBUG 1
#endif

#define NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF(...)                          \
    do{                                                                  \
        if (NRF_DRV_USBD_PROTO1_FIX_DEBUG){ NRF_LOG_DEBUG(__VA_ARGS__); }\
    } while (0)

#ifndef NRF_DRV_USBD_STARTED_EV_ENABLE
    #define NRF_DRV_USBD_STARTED_EV_ENABLE    0
#endif

#ifndef USBD_CONFIG_ISO_IN_ZLP
    #define USBD_CONFIG_ISO_IN_ZLP  0
#endif

#ifndef NRF_USBD_ISO_DEBUG
    /*  Also generate information about ISOCHRONOUS events and transfers.
    Turn this off if no ISOCHRONOUS transfers are going to be debugged and this
    option generates a lot of useless messages. */
    #define NRF_USBD_ISO_DEBUG 1
#endif

#ifndef NRF_USBD_FAILED_TRANSFERS_DEBUG
    /*  Also generate debug information for failed transfers.
    It might be useful but may generate a lot of useless debug messages
    in some library usages (for example when transfer is generated and the
    result is used to check whatever endpoint was busy. */
    #define NRF_USBD_FAILED_TRANSFERS_DEBUG 1
#endif

#ifndef NRF_USBD_DMAREQ_PROCESS_DEBUG
    /*  Generate additional messages that mark the status inside
    @ref usbd_dmareq_process.
    It is useful to debug library internals but may generate a lot of
    useless debug messages. */
    #define NRF_USBD_DMAREQ_PROCESS_DEBUG 1
#endif


/**
    @defgroup nrf_drv_usbd_int USB Device driver internal part
    @internal
    @ingroup nrf_drv_usbd

    This part contains auxiliary internal macros, variables and functions.
    @{
*/

/**
    @brief Assert endpoint number validity

    Internal macro to be used during program creation in debug mode.
    Generates assertion if endpoint number is not valid.

    @param ep Endpoint number to validity check
*/
#define USBD_ASSERT_EP_VALID(ep) ASSERT(                                         \
                                                                                 ((NRF_USBD_EPIN_CHECK(ep)  && (NRF_USBD_EP_NR_GET(ep) < NRF_USBD_EPIN_CNT )) \
                                                                                  ||                                                                           \
                                                                                  (NRF_USBD_EPOUT_CHECK(ep) && (NRF_USBD_EP_NR_GET(ep) < NRF_USBD_EPOUT_CNT))) \
                                       );

/**
    @brief Lowest position of bit for IN endpoint

    The first bit position corresponding to IN endpoint.
    @sa ep2bit bit2ep
*/
#define USBD_EPIN_BITPOS_0   0

/**
    @brief Lowest position of bit for OUT endpoint

    The first bit position corresponding to OUT endpoint
    @sa ep2bit bit2ep
*/
#define USBD_EPOUT_BITPOS_0  16

/**
    @brief Input endpoint bits mask
*/
#define USBD_EPIN_BIT_MASK (0xFFFFU << USBD_EPIN_BITPOS_0)

/**
    @brief Output endpoint bits mask
*/
#define USBD_EPOUT_BIT_MASK (0xFFFFU << USBD_EPOUT_BITPOS_0)

/**
    @brief Isochronous endpoint bit mask
*/
#define USBD_EPISO_BIT_MASK \
    ((1U << USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT8)) | (1U << USBD_EP_BITPOS(NRF_DRV_USBD_EPIN8)))

/**
    @brief Auxiliary macro to change EP number into bit position

