hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    This macro is used by @ref ep2bit function but also for statically check
    the bitpos values integrity during compilation.

    @param[in] ep Endpoint number.
    @return Endpoint bit position.
*/
#define USBD_EP_BITPOS(ep) \
    ((NRF_USBD_EPIN_CHECK(ep) ? USBD_EPIN_BITPOS_0 : USBD_EPOUT_BITPOS_0) + NRF_USBD_EP_NR_GET(ep))

/**
    @brief Helper macro for creating an endpoint transfer event.

    @param[in] name     Name of the created transfer event variable.
    @param[in] endpoint Endpoint number.
    @param[in] ep_stat  Endpoint state to report.

    @return Initialized event constant variable.
*/
#define NRF_DRV_USBD_EP_TRANSFER_EVENT(name, endpont, ep_stat)          \
    const nrf_drv_usbd_evt_t name = {                                   \
                                                                        NRF_DRV_USBD_EVT_EPTRANSFER,                                    \
                                                                        .data = {                                                       \
                                                                                                                                        .eptransfer = {                                             \
                                                                                                                                                                                                    .ep = endpont,                                      \
                                                                                                                                                                                                    .status = ep_stat                                   \
                                                                                                                                                      }                                                           \
                                                                                }                                                               \
                                    }

/* Check it the bit positions values match defined DATAEPSTATUS bit positions */
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN1)  == USBD_EPDATASTATUS_EPIN1_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN2)  == USBD_EPDATASTATUS_EPIN2_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN3)  == USBD_EPDATASTATUS_EPIN3_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN4)  == USBD_EPDATASTATUS_EPIN4_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN5)  == USBD_EPDATASTATUS_EPIN5_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN6)  == USBD_EPDATASTATUS_EPIN6_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPIN7)  == USBD_EPDATASTATUS_EPIN7_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT1) == USBD_EPDATASTATUS_EPOUT1_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT2) == USBD_EPDATASTATUS_EPOUT2_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT3) == USBD_EPDATASTATUS_EPOUT3_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT4) == USBD_EPDATASTATUS_EPOUT4_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT5) == USBD_EPDATASTATUS_EPOUT5_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT6) == USBD_EPDATASTATUS_EPOUT6_Pos);
STATIC_ASSERT(USBD_EP_BITPOS(NRF_DRV_USBD_EPOUT7) == USBD_EPDATASTATUS_EPOUT7_Pos);


/**
    @name Internal auxiliary definitions for SETUP packet

    Definitions used to take out the information about last SETUP packet direction
    from @c bmRequestType.
    @{
*/
/** The position of DIR bit in bmRequestType inside SETUP packet */
#define USBD_DRV_REQUESTTYPE_DIR_BITPOS 7
/** The mask of DIR bit in bmRequestType inside SETUP packet */
#define USBD_DRV_REQUESTTYPE_DIR_MASK   (1U << USBD_DRV_REQUESTTYPE_DIR_BITPOS)
/** The value of DIR bit for OUT direction (Host -> Device) */
#define USBD_DRV_REQUESTTYPE_DIR_OUT    (0U << USBD_DRV_REQUESTTYPE_DIR_BITPOS)
/** The value of DIR bit for IN direction (Device -> Host) */
#define USBD_DRV_REQUESTTYPE_DIR_IN     (1U << USBD_DRV_REQUESTTYPE_DIR_BITPOS)
/** @} */

/**
    @brief Current driver state
*/
static nrfx_drv_state_t m_drv_state = NRFX_DRV_STATE_UNINITIALIZED;

/**
    @brief Event handler for the library

    Event handler that would be called on events.

    @note Currently it cannot be null if any interrupt is activated.
*/
static nrf_drv_usbd_event_handler_t m_event_handler;

/**
    @brief Detected state of the bus

    Internal state changed in interrupts handling when
    RESUME or SUSPEND event is processed.

    Values:
    - true  - bus suspended
    - false - ongoing normal communication on the bus

    @note This is only the bus state and does not mean that the peripheral is in suspend state.
*/
static volatile bool m_bus_suspend;

/**
    @brief Internal constant that contains interrupts disabled in suspend state

    Internal constant used in @ref nrf_drv_usbd_suspend_irq_config and @ref nrf_drv_usbd_active_irq_config
    functions.
*/
static const uint32_t m_irq_disabled_in_suspend =
    NRF_USBD_INT_ENDEPIN0_MASK    |
    NRF_USBD_INT_EP0DATADONE_MASK |
    NRF_USBD_INT_ENDEPOUT0_MASK   |
    NRF_USBD_INT_EP0SETUP_MASK    |
    NRF_USBD_INT_DATAEP_MASK;

/**
    @brief Direction of last received Setup transfer

    This variable is used to redirect internal setup data event
    into selected endpoint (IN or OUT).
*/
static nrf_drv_usbd_ep_t m_last_setup_dir;

/**
    @brief Mark endpoint readiness for DMA transfer

    Bits in this variable are cleared and set in interrupts.
    1 means that endpoint is ready for DMA transfer.
    0 means that DMA transfer cannot be performed on selected endpoint.
*/
static uint32_t m_ep_ready;

/**
    @brief Mark endpoint with prepared data to transfer by DMA

    This variable can be from any place in the code (interrupt or main thread).
    It would be cleared only from USBD interrupt.

    Mask prepared USBD data for transmission.
    It is cleared when no more data to transmit left.
*/
static uint32_t m_ep_dma_waiting;

/**
    @brief Current EasyDMA state

