hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    Single flag, updated only inside interrupts, that marks current EasyDMA state.
    In USBD there is only one DMA channel working in background, and new transfer
    cannot be started when there is ongoing transfer on any other channel.
*/
static bool m_dma_pending;

/**
    @brief Simulated data EP status bits required for errata 104

    Marker to delete when not required anymore: >> NRF_DRV_USBD_ERRATA_ENABLE <<
*/
static uint32_t m_simulated_dataepstatus;

/**
    @brief The structure that would hold transfer configuration to every endpoint

    The structure that holds all the data required by the endpoint to proceed
    with LIST functionality and generate quick callback directly when data
    buffer is ready.
*/
typedef struct
{
    nrf_drv_usbd_handler_t     handler;          //!< Handler for current transfer, function pointer
    void                      *p_context;        //!< Context for transfer handler
    size_t                     transfer_cnt;     //!< Number of transferred bytes in the current transfer
    uint16_t                   max_packet_size;  //!< Configured endpoint size
    nrf_drv_usbd_ep_status_t   status;           //!< NRF_SUCCESS or error code, never NRF_ERROR_BUSY - this one is calculated
} usbd_drv_ep_state_t;

/**
    @brief The array of transfer configurations for the endpoints.

    The status of the transfer on each endpoint.
*/
static struct
{
    usbd_drv_ep_state_t ep_out[NRF_USBD_EPOUT_CNT]; //!< Status for OUT endpoints.
    usbd_drv_ep_state_t ep_in [NRF_USBD_EPIN_CNT ]; //!< Status for IN endpoints.
} m_ep_state;

/**
    @brief Status variables for integrated feeders.

    Current status for integrated feeders (IN transfers).
    Integrated feeders are used for default transfers:
    1. Simple RAM transfer
    2. Simple flash transfer
    3. RAM transfer with automatic ZLP
    4. Flash transfer with automatic ZLP
*/
nrf_drv_usbd_transfer_t m_ep_feeder_state[NRF_USBD_EPIN_CNT];

/**
    @brief Status variables for integrated consumers

    Current status for integrated consumers
    Currently one type of transfer is supported:
    1. Transfer to RAM

    Transfer is finished automatically when received data block is smaller
    than the endpoint buffer or all the required data is received.
*/
nrf_drv_usbd_transfer_t m_ep_consumer_state[NRF_USBD_EPOUT_CNT];


/**
    @brief Buffer used to send data directly from FLASH

    This is internal buffer that would be used to emulate the possibility
    to transfer data directly from FLASH.
    We do not have to care about the source of data when calling transfer functions.

    We do not need more buffers that one, because only one transfer can be pending
    at once.
*/
static uint32_t m_tx_buffer[CEIL_DIV(
                                NRF_DRV_USBD_FEEDER_BUFFER_SIZE, sizeof(uint32_t))];


/* Early declaration. Documentation above definition. */
static void usbd_dmareq_process(void);


/**
    @brief Change endpoint number to endpoint event code

    @param ep Endpoint number

    @return Connected endpoint event code.

    Marker to delete when not required anymore: >> NRF_DRV_USBD_ERRATA_ENABLE <<
*/
static inline nrf_usbd_event_t nrf_drv_usbd_ep_to_endevent(nrf_drv_usbd_ep_t ep)
{
    USBD_ASSERT_EP_VALID(ep);
    
    static const nrf_usbd_event_t epin_endev[] =
    {
        NRF_USBD_EVENT_ENDEPIN0,
        NRF_USBD_EVENT_ENDEPIN1,
        NRF_USBD_EVENT_ENDEPIN2,
        NRF_USBD_EVENT_ENDEPIN3,
        NRF_USBD_EVENT_ENDEPIN4,
        NRF_USBD_EVENT_ENDEPIN5,
        NRF_USBD_EVENT_ENDEPIN6,
        NRF_USBD_EVENT_ENDEPIN7,
        NRF_USBD_EVENT_ENDISOIN0
    };
    static const nrf_usbd_event_t epout_endev[] =
    {
        NRF_USBD_EVENT_ENDEPOUT0,
        NRF_USBD_EVENT_ENDEPOUT1,
        NRF_USBD_EVENT_ENDEPOUT2,
        NRF_USBD_EVENT_ENDEPOUT3,
        NRF_USBD_EVENT_ENDEPOUT4,
        NRF_USBD_EVENT_ENDEPOUT5,
        NRF_USBD_EVENT_ENDEPOUT6,
        NRF_USBD_EVENT_ENDEPOUT7,
        NRF_USBD_EVENT_ENDISOOUT0
    };
    
    return (NRF_USBD_EPIN_CHECK(ep) ? epin_endev : epout_endev)[NRF_USBD_EP_NR_GET(ep)];
}


/**
    @brief Get interrupt mask for selected endpoint

    @param[in] ep Endpoint number

    @return Interrupt mask related to the EasyDMA transfer end for the
           chosen endpoint.
*/
static inline uint32_t nrf_drv_usbd_ep_to_int(nrf_drv_usbd_ep_t ep)
{
    USBD_ASSERT_EP_VALID(ep);
    
    static const uint8_t epin_bitpos[] =
    {
        USBD_INTEN_ENDEPIN0_Pos,
        USBD_INTEN_ENDEPIN1_Pos,
        USBD_INTEN_ENDEPIN2_Pos,
        USBD_INTEN_ENDEPIN3_Pos,
        USBD_INTEN_ENDEPIN4_Pos,
        USBD_INTEN_ENDEPIN5_Pos,
        USBD_INTEN_ENDEPIN6_Pos,
        USBD_INTEN_ENDEPIN7_Pos,
        USBD_INTEN_ENDISOIN_Pos
    };
    static const uint8_t epout_bitpos[] =
    {
        USBD_INTEN_ENDEPOUT0_Pos,
        USBD_INTEN_ENDEPOUT1_Pos,
        USBD_INTEN_ENDEPOUT2_Pos,
        USBD_INTEN_ENDEPOUT3_Pos,
        USBD_INTEN_ENDEPOUT4_Pos,
        USBD_INTEN_ENDEPOUT5_Pos,
        USBD_INTEN_ENDEPOUT6_Pos,
        USBD_INTEN_ENDEPOUT7_Pos,
        USBD_INTEN_ENDISOOUT_Pos
    };
    
    return 1UL << (NRF_USBD_EPIN_CHECK(ep) ? epin_bitpos : epout_bitpos)[NRF_USBD_EP_NR_GET(ep)];
}

/**
    @name Integrated feeders and consumers

    Internal, default functions for transfer processing.
    @{
*/

/**
    @brief Integrated consumer to RAM buffer.

    @param p_next    See @ref nrf_drv_usbd_consumer_t documentation.
    @param p_context See @ref nrf_drv_usbd_consumer_t documentation.
    @param ep_size   See @ref nrf_drv_usbd_consumer_t documentation.
    @param data_size See @ref nrf_drv_usbd_consumer_t documentation.

    @retval true  Continue transfer.
    @retval false This was the last transfer.
*/
bool nrf_drv_usbd_consumer(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size,
    size_t data_size)
{
    nrf_drv_usbd_transfer_t *p_transfer = p_context;
    ASSERT(ep_size >= data_size);
    ASSERT((p_transfer->p_data.rx == NULL) ||
           nrfx_is_in_ram((const void *)(p_transfer->p_data.ptr)));
           
    size_t size = p_transfer->size;
    
    if(size < data_size)
    {
        NRF_LOG_DEBUG("consumer: buffer too small: r: %u, l: %u", data_size, size);
        /* Buffer size to small */
        p_next->size = 0;
        p_next->p_data = p_transfer->p_data;
    }
    
    else
    {
        p_next->size = data_size;
        p_next->p_data = p_transfer->p_data;
        size -= data_size;
        p_transfer->size = size;
        p_transfer->p_data.ptr += data_size;
    }
    
    return (ep_size == data_size) && (size != 0);
}

/**
    @brief Integrated feeder from RAM source.

    @param[out]    p_next    See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in,out] p_context See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in]     ep_size   See @ref nrf_drv_usbd_feeder_t documentation.

    @retval true  Continue transfer.
    @retval false This was the last transfer.
*/
bool nrf_drv_usbd_feeder_ram(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size)
{
    nrf_drv_usbd_transfer_t *p_transfer = p_context;
    ASSERT(nrfx_is_in_ram((const void *)(p_transfer->p_data.ptr)));
    
    size_t tx_size = p_transfer->size;
    
    if(tx_size > ep_size)
        tx_size = ep_size;
        
