hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    p_next->p_data = p_transfer->p_data;
    p_next->size = tx_size;
    
    p_transfer->size -= tx_size;
    p_transfer->p_data.ptr += tx_size;
    
    return (p_transfer->size != 0);
}

/**
    @brief Integrated feeder from RAM source with ZLP.

    @param[out]    p_next    See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in,out] p_context See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in]     ep_size   See @ref nrf_drv_usbd_feeder_t documentation.

    @retval true  Continue transfer.
    @retval false This was the last transfer.
*/
bool nrf_drv_usbd_feeder_ram_zlp(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size)
{
    nrf_drv_usbd_transfer_t *p_transfer = p_context;
    ASSERT(nrfx_is_in_ram((const void *)(p_transfer->p_data.ptr)));
    
    size_t tx_size = p_transfer->size;
    
    if(tx_size > ep_size)
        tx_size = ep_size;
        
    p_next->p_data.tx = (tx_size == 0) ? NULL : p_transfer->p_data.tx;
    p_next->size = tx_size;
    
    p_transfer->size -= tx_size;
    p_transfer->p_data.ptr += tx_size;
    
    return (tx_size != 0);
}

/**
    @brief Integrated feeder from a flash source.

    @param[out]    p_next    See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in,out] p_context See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in]     ep_size   See @ref nrf_drv_usbd_feeder_t documentation.

    @retval true  Continue transfer.
    @retval false This was the last transfer.
*/
bool nrf_drv_usbd_feeder_flash(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size)
{
    nrf_drv_usbd_transfer_t *p_transfer = p_context;
    ASSERT(!nrfx_is_in_ram((const void *)(p_transfer->p_data.ptr)));
    
    size_t tx_size  = p_transfer->size;
    void *p_buffer = nrf_drv_usbd_feeder_buffer_get();
    
    if(tx_size > ep_size)
        tx_size = ep_size;
        
    ASSERT(tx_size <= NRF_DRV_USBD_FEEDER_BUFFER_SIZE);
    memcpy(p_buffer, (p_transfer->p_data.tx), tx_size);
    
    p_next->p_data.tx = p_buffer;
    p_next->size = tx_size;
    
    p_transfer->size -= tx_size;
    p_transfer->p_data.ptr += tx_size;
    
    return (p_transfer->size != 0);
}

/**
    @brief Integrated feeder from a flash source with ZLP.

    @param[out]    p_next    See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in,out] p_context See @ref nrf_drv_usbd_feeder_t documentation.
    @param[in]     ep_size   See @ref nrf_drv_usbd_feeder_t documentation.

    @retval true  Continue transfer.
    @retval false This was the last transfer.
*/
bool nrf_drv_usbd_feeder_flash_zlp(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size)
{
    nrf_drv_usbd_transfer_t *p_transfer = p_context;
    ASSERT(!nrfx_is_in_ram((const void *)(p_transfer->p_data.ptr)));
    
    size_t tx_size  = p_transfer->size;
    void *p_buffer = nrf_drv_usbd_feeder_buffer_get();
    
    if(tx_size > ep_size)
        tx_size = ep_size;
        
    ASSERT(tx_size <= NRF_DRV_USBD_FEEDER_BUFFER_SIZE);
    
    if(tx_size != 0)
    {
        memcpy(p_buffer, (p_transfer->p_data.tx), tx_size);
        p_next->p_data.tx = p_buffer;
    }
    
    else
        p_next->p_data.tx = NULL;
        
    p_next->size = tx_size;
    
    p_transfer->size -= tx_size;
    p_transfer->p_data.ptr += tx_size;
    
    return (tx_size != 0);
}

/** @} */

/**
    @brief Change Driver endpoint number to HAL endpoint number

    @param ep Driver endpoint identifier

    @return Endpoint identifier in HAL

    @sa nrf_drv_usbd_ep_from_hal
*/
static inline uint8_t ep_to_hal(nrf_drv_usbd_ep_t ep)
{
    USBD_ASSERT_EP_VALID(ep);
    return (uint8_t)ep;
}

/**
    @brief Generate start task number for selected endpoint index

    @param ep Endpoint number

    @return Task for starting EasyDMA transfer on selected endpoint.
*/
static inline nrf_usbd_task_t task_start_ep(nrf_drv_usbd_ep_t ep)
{
    USBD_ASSERT_EP_VALID(ep);
    return (nrf_usbd_task_t)(
               (NRF_USBD_EPIN_CHECK(ep) ? NRF_USBD_TASK_STARTEPIN0 : NRF_USBD_TASK_STARTEPOUT0) +
               (NRF_USBD_EP_NR_GET(ep) * sizeof(uint32_t)));
}

/**
    @brief Access selected endpoint state structure

    Function used to change or just read the state of selected endpoint.
    It is used for internal transmission state.

    @param ep Endpoint number
*/
static inline usbd_drv_ep_state_t *ep_state_access(nrf_drv_usbd_ep_t ep)
{
    USBD_ASSERT_EP_VALID(ep);
    return ((NRF_USBD_EPIN_CHECK(ep) ? m_ep_state.ep_in : m_ep_state.ep_out) +
            NRF_USBD_EP_NR_GET(ep));
}

/**
    @brief Change endpoint number to bit position

    Bit positions are defined the same way as they are placed in DATAEPSTATUS register,
    but bits for endpoint 0 are included.

    @param ep Endpoint number

    @return Bit position related to the given endpoint number

    @sa bit2ep
*/
static inline uint8_t ep2bit(nrf_drv_usbd_ep_t ep)
{
    USBD_ASSERT_EP_VALID(ep);
    return USBD_EP_BITPOS(ep);
}

/**
    @brief Change bit position to endpoint number

    @param bitpos Bit position

    @return Endpoint number corresponding to given bit position.

    @sa ep2bit
*/
static inline nrf_drv_usbd_ep_t bit2ep(uint8_t bitpos)
{
    STATIC_ASSERT(USBD_EPOUT_BITPOS_0 > USBD_EPIN_BITPOS_0);
    return (nrf_drv_usbd_ep_t)((bitpos >= USBD_EPOUT_BITPOS_0) ?
                               NRF_USBD_EPOUT(bitpos - USBD_EPOUT_BITPOS_0) : NRF_USBD_EPIN(bitpos));
}

/**
    @brief Mark that EasyDMA is working

    Internal function to set the flag informing about EasyDMA transfer pending.
    This function is called always just after the EasyDMA transfer is started.
*/
static inline void usbd_dma_pending_set(void)
{
    if(nrf_drv_usb_errata_199())
        *((volatile uint32_t *)0x40027C1C) = 0x00000082;
        
    m_dma_pending = true;
}

/**
    @brief Mark that EasyDMA is free

    Internal function to clear the flag informing about EasyDMA transfer pending.
    This function is called always just after the finished EasyDMA transfer is detected.
*/
static inline void usbd_dma_pending_clear(void)
{
    if(nrf_drv_usb_errata_199())
        *((volatile uint32_t *)0x40027C1C) = 0x00000000;
        
    m_dma_pending = false;
}

/**
    @brief Start selected EasyDMA transmission

    This is internal auxiliary function.
    No checking is made if EasyDMA is ready for new transmission.

    @param[in] ep Number of endpoint for transmission.
                 If it is OUT endpoint transmission would be directed from endpoint to RAM.
                 If it is in endpoint transmission would be directed from RAM to endpoint.
*/
static inline void usbd_dma_start(nrf_drv_usbd_ep_t ep)
{
    nrf_usbd_task_trigger(task_start_ep(ep));
}


void nrf_drv_usbd_isoinconfig_set(nrf_usbd_isoinconfig_t config)
{
    ASSERT(!nrf_drv_usbd_errata_type_52840_eng_a());
    nrf_usbd_isoinconfig_set(config);
}

nrf_usbd_isoinconfig_t nrf_drv_usbd_isoinconfig_get(void)
{
    ASSERT(!nrf_drv_usbd_errata_type_52840_eng_a());
    return nrf_usbd_isoinconfig_get();
}

/**
    @brief Abort pending transfer on selected endpoint

