hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    @param ep Endpoint number.

    @note
    This function locks interrupts that may be costly.
    It is good idea to test if the endpoint is still busy before calling this function:
    @code
    (m_ep_dma_waiting & (1U << ep2bit(ep)))
    @endcode
    This function would check it again, but it makes it inside critical section.
*/
static inline void usbd_ep_abort(nrf_drv_usbd_ep_t ep)
{
    CRITICAL_REGION_ENTER();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EPOUT_CHECK(ep))
    {
        /* Host -> Device */
        if((~m_ep_dma_waiting) & (1U << ep2bit(ep)))
        {
            /*  If the bit in m_ep_dma_waiting in cleared - nothing would be
                processed inside transfer processing */
            nrf_drv_usbd_transfer_out_drop(ep);
        }
        
        else
        {
            p_state->handler.consumer = NULL;
            m_ep_dma_waiting &= ~(1U << ep2bit(ep));
            m_ep_ready &= ~(1U << ep2bit(ep));
        }
        
        /* Aborted */
        p_state->status = NRF_USBD_EP_ABORTED;
    }
    
    else
    {
        if(!NRF_USBD_EPISO_CHECK(ep))
        {
            if(ep != NRF_DRV_USBD_EPIN0)
            {
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7B6 + (2u * (NRF_USBD_EP_NR_GET(ep) - 1)); //inxbsy
                uint8_t temp = *((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                temp |= (1U << 1);
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) |= temp;
                UNUSED_VARIABLE(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            }
            
            else
            {
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7B4;
                uint8_t temp = *((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                temp |= (1U << 2);
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) |= temp;
                UNUSED_VARIABLE(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            }
        }
        
        if((m_ep_dma_waiting | (~m_ep_ready)) & (1U << ep2bit(ep)))
        {
            /* Device -> Host */
            m_ep_dma_waiting &= ~(1U << ep2bit(ep));
            m_ep_ready       |=   1U << ep2bit(ep) ;
            
            p_state->handler.feeder = NULL;
            p_state->status = NRF_USBD_EP_ABORTED;
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_ABORTED);
            m_event_handler(&evt);
        }
    }
    
    CRITICAL_REGION_EXIT();
}

void nrf_drv_usbd_ep_abort(nrf_drv_usbd_ep_t ep)
{
    usbd_ep_abort(ep);
}


/**
    @brief Abort all pending endpoints

    Function aborts all pending endpoint transfers.
*/
static void usbd_ep_abort_all(void)
{
    uint32_t ep_waiting = m_ep_dma_waiting | (m_ep_ready & USBD_EPOUT_BIT_MASK);
    
    while(0 != ep_waiting)
    {
        uint8_t bitpos = __CLZ(__RBIT(ep_waiting));
        
        if(!NRF_USBD_EPISO_CHECK(bit2ep(bitpos)))
            usbd_ep_abort(bit2ep(bitpos));
            
        ep_waiting &= ~(1U << bitpos);
    }
    
    m_ep_ready = (((1U << NRF_USBD_EPIN_CNT) - 1U) << USBD_EPIN_BITPOS_0);
}

/**
    @brief Force the USBD interrupt into pending state

    This function is used to force USBD interrupt to be processed right now.
    It makes it possible to process all EasyDMA access on one thread priority level.
*/
static inline void usbd_int_rise(void)
{
    NVIC_SetPendingIRQ(USBD_IRQn);
}

/**
    @name USBD interrupt runtimes

    Interrupt runtimes that would be vectorized using @ref m_ivec_isr
    @{
*/

static void ev_usbreset_handler(void)
{
    m_bus_suspend = false;
    m_last_setup_dir = NRF_DRV_USBD_EPOUT0;
    
    const nrf_drv_usbd_evt_t evt =
    {
        .type = NRF_DRV_USBD_EVT_RESET
    };
    
    m_event_handler(&evt);
}

static void ev_started_handler(void)
{
    #if NRF_DRV_USBD_STARTED_EV_ENABLE
    uint32_t epstatus = nrf_usbd_epstatus_get_and_clear();
    
    /* All finished endpoint have to be marked as busy */
    // #warning Check this one
    // ASSERT(epstatus == ((~m_ep_ready) & epstatus));
    while(epstatus)
    {
        uint8_t           bitpos = __CLZ(__RBIT(epstatus));
        nrf_drv_usbd_ep_t ep     = bit2ep(bitpos);
        epstatus                &= ~(1UL << bitpos);
        
        UNUSED_VARIABLE(ep);
    }
    
    #endif
}

/**
    @brief Handler for EasyDMA event without endpoint clearing.

    This handler would be called when EasyDMA transfer for endpoints that does not require clearing.
    All in endpoints are cleared automatically when new EasyDMA transfer is initialized.
    For endpoint 0 see @ref nrf_usbd_ep0out_dma_handler

    @param[in] ep Endpoint number
*/
static inline void nrf_usbd_ep0in_dma_handler(void)
{
    const nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPIN0;
    NRF_LOG_DEBUG("USB event: DMA ready IN0");
    usbd_dma_pending_clear();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EP_ABORTED == p_state->status)
    {
        /* Clear transfer information just in case */
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
    }
    
    else if(p_state->handler.feeder == NULL)
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
        
    else
    {
        /* Nothing to do */
    }
}

/**
    @brief Handler for EasyDMA event without endpoint clearing.

    This handler would be called when EasyDMA transfer for endpoints that does not require clearing.
    All in endpoints are cleared automatically when new EasyDMA transfer is initialized.
    For endpoint 0 see @ref nrf_usbd_ep0out_dma_handler

    @param[in] ep Endpoint number
*/
static inline void nrf_usbd_epin_dma_handler(nrf_drv_usbd_ep_t ep)
{

    NRF_LOG_DEBUG("USB event: DMA ready IN: %x", ep);
    ASSERT(NRF_USBD_EPIN_CHECK(ep));
    ASSERT(!NRF_USBD_EPISO_CHECK(ep));
    ASSERT(NRF_USBD_EP_NR_GET(ep) > 0);
    usbd_dma_pending_clear();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EP_ABORTED == p_state->status)
    {
        /* Clear transfer information just in case */
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
    }
    
