hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    else if(p_state->handler.feeder == NULL)
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
        
    else
    {
        /* Nothing to do */
    }
}

/**
    @brief Handler for EasyDMA event from in isochronous endpoint

    @todo RK documentation
*/
static inline void nrf_usbd_epiniso_dma_handler(nrf_drv_usbd_ep_t ep)
{
    if(NRF_USBD_ISO_DEBUG)
        NRF_LOG_DEBUG("USB event: DMA ready ISOIN: %x", ep);
        
    ASSERT(NRF_USBD_EPIN_CHECK(ep));
    ASSERT(NRF_USBD_EPISO_CHECK(ep));
    usbd_dma_pending_clear();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EP_ABORTED == p_state->status)
    {
        /* Clear transfer information just in case */
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
    }
    
    else if(p_state->handler.feeder == NULL)
    {
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
        /* Send event to the user - for an ISO IN endpoint, the whole transfer is finished in this moment */
        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
        m_event_handler(&evt);
    }
    
    else
    {
        /* Nothing to do */
    }
}

/**
    @brief Handler for EasyDMA event for OUT endpoint 0.

    EP0 OUT have to be cleared automatically in special way - only in the middle of the transfer.
    It cannot be cleared when required transfer is finished because it means the same that accepting the comment.
*/
static inline void nrf_usbd_ep0out_dma_handler(void)
{
    const nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPOUT0;
    NRF_LOG_DEBUG("USB event: DMA ready OUT0");
    usbd_dma_pending_clear();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EP_ABORTED == p_state->status)
    {
        /* Clear transfer information just in case */
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
    }
    
    else if(p_state->handler.consumer == NULL)
    {
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
        /* Send event to the user - for an OUT endpoint, the whole transfer is finished in this moment */
        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
        m_event_handler(&evt);
    }
    
    else
        nrf_drv_usbd_setup_data_clear();
}

/**
    @brief Handler for EasyDMA event from endpoinpoint that requires clearing.

    This handler would be called when EasyDMA transfer for OUT endpoint has been finished.

    @param[in] ep Endpoint number

*/
static inline void nrf_usbd_epout_dma_handler(nrf_drv_usbd_ep_t ep)
{
    NRF_LOG_DEBUG("USB drv: DMA ready OUT: %x", ep);
    ASSERT(NRF_USBD_EPOUT_CHECK(ep));
    ASSERT(!NRF_USBD_EPISO_CHECK(ep));
    ASSERT(NRF_USBD_EP_NR_GET(ep) > 0);
    usbd_dma_pending_clear();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EP_ABORTED == p_state->status)
    {
        /* Clear transfer information just in case */
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
    }
    
    else if(p_state->handler.consumer == NULL)
    {
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
        /* Send event to the user - for an OUT endpoint, the whole transfer is finished in this moment */
        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
        m_event_handler(&evt);
    }
    
    else
    {
        /* Nothing to do */
    }
    
    #if NRF_DRV_USBD_EARLY_DMA_PROCESS
    /* Speed up */
    usbd_dmareq_process();
    #endif
}

/**
    @brief Handler for EasyDMA event from out isochronous endpoint

    @todo RK documentation
*/

static inline void nrf_usbd_epoutiso_dma_handler(nrf_drv_usbd_ep_t ep)
{
    if(NRF_USBD_ISO_DEBUG)
        NRF_LOG_DEBUG("USB drv: DMA ready ISOOUT: %x", ep);
        
    ASSERT(NRF_USBD_EPISO_CHECK(ep));
    usbd_dma_pending_clear();
    
    usbd_drv_ep_state_t *p_state = ep_state_access(ep);
    
    if(NRF_USBD_EP_ABORTED == p_state->status)
    {
        /* Nothing to do - just ignore */
    }
    else if(p_state->handler.consumer == NULL)
    {
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));
        /* Send event to the user - for an OUT endpoint, the whole transfer is finished in this moment */
        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
        m_event_handler(&evt);
    }
    
    else
    {
        /* Nothing to do */
    }
}


static void ev_dma_epin0_handler(void)
{
    nrf_usbd_ep0in_dma_handler();
}
static void ev_dma_epin1_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN1);
}
static void ev_dma_epin2_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN2);
}
static void ev_dma_epin3_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN3);
}
static void ev_dma_epin4_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN4);
}
static void ev_dma_epin5_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN5);
}
static void ev_dma_epin6_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN6);
}
static void ev_dma_epin7_handler(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN7);
}
static void ev_dma_epin8_handler(void)
{
    nrf_usbd_epiniso_dma_handler(NRF_DRV_USBD_EPIN8);
}

static void ev_dma_epout0_handler(void)
{
    nrf_usbd_ep0out_dma_handler();
}
static void ev_dma_epout1_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT1);
}
static void ev_dma_epout2_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT2);
}
static void ev_dma_epout3_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT3);
}
static void ev_dma_epout4_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT4);
}
static void ev_dma_epout5_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT5);
}
static void ev_dma_epout6_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT6);
}
static void ev_dma_epout7_handler(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT7);
}
static void ev_dma_epout8_handler(void)
{
    nrf_usbd_epoutiso_dma_handler(NRF_DRV_USBD_EPOUT8);
}

static void ev_sof_handler(void)
{
    nrf_drv_usbd_evt_t evt =
    {
        NRF_DRV_USBD_EVT_SOF,
        .data = { .sof = { .framecnt = nrf_usbd_framecntr_get() }}
    };
    
    /* Process isochronous endpoints */
    uint32_t iso_ready_mask = (1U << ep2bit(NRF_DRV_USBD_EPIN8));
    
    if(nrf_usbd_episoout_size_get(NRF_DRV_USBD_EPOUT8) != NRF_USBD_EPISOOUT_NO_DATA)
        iso_ready_mask |= (1U << ep2bit(NRF_DRV_USBD_EPOUT8));
        
