hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    m_ep_ready |= iso_ready_mask;
    
    m_event_handler(&evt);
}

/**
    @brief React on data transfer finished

    Auxiliary internal function.
    @param ep     Endpoint number
    @param bitpos Bit position for selected endpoint number
*/
static void usbd_ep_data_handler(nrf_drv_usbd_ep_t ep, uint8_t bitpos)
{
    NRF_LOG_DEBUG("USBD event: EndpointData: %x", ep);
    /* Mark endpoint ready for next DMA access */
    m_ep_ready |= (1U << bitpos);
    
    if(NRF_USBD_EPIN_CHECK(ep))
    {
        /* IN endpoint (Device -> Host) */
        if(0 == (m_ep_dma_waiting & (1U << bitpos)))
        {
            NRF_LOG_DEBUG("USBD event: EndpointData: In finished");
            /* No more data to be send - transmission finished */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
            m_event_handler(&evt);
        }
    }
    
    else
    {
        /* OUT endpoint (Host -> Device) */
        if(0 == (m_ep_dma_waiting & (1U << bitpos)))
        {
            NRF_LOG_DEBUG("USBD event: EndpointData: Out waiting");
            /* No buffer prepared - send event to the application */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_WAITING);
            m_event_handler(&evt);
        }
    }
}

static void ev_setup_data_handler(void)
{
    usbd_ep_data_handler(m_last_setup_dir, ep2bit(m_last_setup_dir));
}

static void ev_setup_handler(void)
{
    NRF_LOG_DEBUG("USBD event: Setup (rt:%.2x r:%.2x v:%.4x i:%.4x l:%u )",
                  nrf_usbd_setup_bmrequesttype_get(),
                  nrf_usbd_setup_brequest_get(),
                  nrf_usbd_setup_wvalue_get(),
                  nrf_usbd_setup_windex_get(),
                  nrf_usbd_setup_wlength_get());
    uint8_t bmRequestType = nrf_usbd_setup_bmrequesttype_get();
    
    
    if((m_ep_dma_waiting | ((~m_ep_ready) & USBD_EPIN_BIT_MASK)) & (1U << ep2bit(m_last_setup_dir)))
    {
        NRF_LOG_DEBUG("USBD drv: Trying to abort last transfer on EP0");
        usbd_ep_abort(m_last_setup_dir);
    }
    
    m_last_setup_dir =
        ((bmRequestType & USBD_DRV_REQUESTTYPE_DIR_MASK) == USBD_DRV_REQUESTTYPE_DIR_OUT) ?
        NRF_DRV_USBD_EPOUT0 : NRF_DRV_USBD_EPIN0;
        
    UNUSED_RETURN_VALUE(nrf_atomic_u32_and(
                            &m_ep_dma_waiting,
                            ~((1U << ep2bit(NRF_DRV_USBD_EPOUT0)) | (1U << ep2bit(NRF_DRV_USBD_EPIN0)))));
    m_ep_ready |= 1U << ep2bit(NRF_DRV_USBD_EPIN0);
    
    
    const nrf_drv_usbd_evt_t evt =
    {
        .type = NRF_DRV_USBD_EVT_SETUP
    };
    m_event_handler(&evt);
}

static void ev_usbevent_handler(void)
{
    uint32_t event = nrf_usbd_eventcause_get_and_clear();
    
    if(event & NRF_USBD_EVENTCAUSE_ISOOUTCRC_MASK)
    {
        NRF_LOG_DEBUG("USBD event: ISOOUTCRC");
        /* Currently no support */
    }
    
    if(event & NRF_USBD_EVENTCAUSE_SUSPEND_MASK)
    {
        NRF_LOG_DEBUG("USBD event: SUSPEND");
        m_bus_suspend = true;
        const nrf_drv_usbd_evt_t evt =
        {
            .type = NRF_DRV_USBD_EVT_SUSPEND
        };
        m_event_handler(&evt);
    }
    
    if(event & NRF_USBD_EVENTCAUSE_RESUME_MASK)
    {
        NRF_LOG_DEBUG("USBD event: RESUME");
        m_bus_suspend = false;
        const nrf_drv_usbd_evt_t evt =
        {
            .type = NRF_DRV_USBD_EVT_RESUME
        };
        m_event_handler(&evt);
    }
    
    if(event & NRF_USBD_EVENTCAUSE_WUREQ_MASK)
    {
        NRF_LOG_DEBUG("USBD event: WUREQ (%s)", m_bus_suspend ? "In Suspend" : "Active");
        
        if(m_bus_suspend)
        {
            ASSERT(!nrf_usbd_lowpower_check());
            m_bus_suspend = false;
            
            nrf_usbd_dpdmvalue_set(NRF_USBD_DPDMVALUE_RESUME);
            nrf_usbd_task_trigger(NRF_USBD_TASK_DRIVEDPDM);
            
            const nrf_drv_usbd_evt_t evt =
            {
                .type = NRF_DRV_USBD_EVT_WUREQ
            };
            m_event_handler(&evt);
        }
    }
}

static void ev_epdata_handler(void)
{
    /* Get all endpoints that have acknowledged transfer */
    uint32_t dataepstatus = nrf_usbd_epdatastatus_get_and_clear();
    
    if(nrf_drv_usbd_errata_104())
    {
        dataepstatus |= (m_simulated_dataepstatus &
                         ~((1U << USBD_EPOUT_BITPOS_0) | (1U << USBD_EPIN_BITPOS_0)));
        m_simulated_dataepstatus &=
            ((1U << USBD_EPOUT_BITPOS_0) | (1U << USBD_EPIN_BITPOS_0));
    }
    
    NRF_LOG_DEBUG("USBD event: EndpointEPStatus: %x", dataepstatus);
    
    /* All finished endpoint have to be marked as busy */
    while(dataepstatus)
    {
        uint8_t           bitpos = __CLZ(__RBIT(dataepstatus));
        nrf_drv_usbd_ep_t ep     = bit2ep(bitpos);
        dataepstatus &= ~(1UL << bitpos);
        
        UNUSED_RETURN_VALUE(usbd_ep_data_handler(ep, bitpos));
    }
    
    if(NRF_DRV_USBD_EARLY_DMA_PROCESS)
    {
        /* Speed up */
        usbd_dmareq_process();
    }
}

/**
    @brief Function to select the endpoint to start

    Function that realizes algorithm to schedule right channel for EasyDMA transfer.
    It gets a variable with flags for the endpoints currently requiring transfer.

    @param[in] req Bit flags for channels currently requiring transfer.
                  Bits 0...8 used for IN endpoints.
                  Bits 16...24 used for OUT endpoints.
    @note
    This function would be never called with 0 as a @c req argument.
    @return The bit number of the endpoint that should be processed now.
*/
static uint8_t usbd_dma_scheduler_algorithm(uint32_t req)
{
    /* Only prioritized scheduling mode is supported */
    STATIC_ASSERT(USBD_CONFIG_DMASCHEDULER_MODE == NRF_DRV_USBD_DMASCHEDULER_PRIORITIZED);
    return __CLZ(__RBIT(req));
}

/**
    @brief Get the size of isochronous endpoint

    The size of isochronous endpoint is configurable.
    This function returns the size of isochronous buffer taking into account
    current configuration.

    @param[in] ep Endpoint number.

    @return The size of endpoint buffer.
*/
static inline size_t usbd_ep_iso_capacity(nrf_drv_usbd_ep_t ep)
{
    UNUSED_PARAMETER(ep);
    nrf_usbd_isosplit_t split = nrf_usbd_isosplit_get();
    
    if(NRF_USBD_ISOSPLIT_Half == split)
        return NRF_DRV_USBD_ISOSIZE / 2;
        
