hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
    return NRF_DRV_USBD_ISOSIZE;
}

/**
    @brief Process all DMA requests

    Function that have to be called from USBD interrupt handler.
    It have to be called when all the interrupts connected with endpoints transfer
    and DMA transfer are already handled.
*/
static void usbd_dmareq_process(void)
{
    if(!m_dma_pending)
    {
        uint32_t req;
        
        while(0 != (req = m_ep_dma_waiting & m_ep_ready))
        {
            uint8_t pos;
            
            if(USBD_CONFIG_DMASCHEDULER_ISO_BOOST && ((req & USBD_EPISO_BIT_MASK) != 0))
                pos = usbd_dma_scheduler_algorithm(req & USBD_EPISO_BIT_MASK);
                
            else
                pos = usbd_dma_scheduler_algorithm(req);
                
            nrf_drv_usbd_ep_t ep = bit2ep(pos);
            usbd_drv_ep_state_t *p_state = ep_state_access(ep);
            
            nrf_drv_usbd_ep_transfer_t transfer;
            bool continue_transfer;
            
            STATIC_ASSERT(offsetof(usbd_drv_ep_state_t, handler.feeder) ==
                          offsetof(usbd_drv_ep_state_t, handler.consumer));
            ASSERT((p_state->handler.feeder) != NULL);
            
            if(NRF_USBD_EPIN_CHECK(ep))
            {
                /* Device -> Host */
                continue_transfer = p_state->handler.feeder(
                                        &transfer,
                                        p_state->p_context,
                                        p_state->max_packet_size);
                                        
                if(!continue_transfer)
                    p_state->handler.feeder = NULL;
            }
            
            else
            {
                /* Host -> Device */
                const size_t rx_size = nrf_drv_usbd_epout_size_get(ep);
                continue_transfer = p_state->handler.consumer(
                                        &transfer,
                                        p_state->p_context,
                                        p_state->max_packet_size,
                                        rx_size);
                                        
                if(transfer.p_data.rx == NULL)
                {
                    /* Dropping transfer - allow processing */
                    ASSERT(transfer.size == 0);
                }
                
                else if(transfer.size < rx_size)
                {
                    NRF_LOG_DEBUG("Endpoint %x overload (r: %u, e: %u)", ep, rx_size, transfer.size);
                    p_state->status = NRF_USBD_EP_OVERLOAD;
                    UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << pos)));
                    NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OVERLOAD);
                    m_event_handler(&evt);
                    /* This endpoint will not be transmitted now, repeat the loop */
                    continue;
                }
                
                else
                {
                    /* Nothing to do - only check integrity if assertions are enabled */
                    ASSERT(transfer.size == rx_size);
                }
                
                if(!continue_transfer)
                    p_state->handler.consumer = NULL;
            }
            
            usbd_dma_pending_set();
            m_ep_ready &= ~(1U << pos);
            
            if(NRF_USBD_ISO_DEBUG || (!NRF_USBD_EPISO_CHECK(ep)))
            {
                NRF_LOG_DEBUG(
                    "USB DMA process: Starting transfer on EP: %x, size: %u",
                    ep,
                    transfer.size);
            }
            
            /* Update number of currently transferred bytes */
            p_state->transfer_cnt += transfer.size;
            /* Start transfer to the endpoint buffer */
            nrf_usbd_ep_easydma_set(ep, transfer.p_data.ptr, (uint32_t)transfer.size);
            
            if(nrf_drv_usbd_errata_104())
            {
                uint32_t cnt_end = (uint32_t)(-1);
                
                do
                {
                    uint32_t cnt = (uint32_t)(-1);
                    
                    do
                    {
                        nrf_usbd_event_clear(NRF_USBD_EVENT_STARTED);
                        usbd_dma_start(ep);
                        nrf_delay_us(2);
                        ++cnt;
                    } while(!nrf_usbd_event_check(NRF_USBD_EVENT_STARTED));
                    
                    if(cnt)
                        NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA restarted: %u times", cnt);
                        
                    nrf_delay_us(30);
                    
                    while(0 == (0x20 & *((volatile uint32_t *)(NRF_USBD_BASE + 0x474))))
                        nrf_delay_us(2);
                        
                    nrf_delay_us(1);
                    
                    ++cnt_end;
                } while(!nrf_usbd_event_check(nrf_drv_usbd_ep_to_endevent(ep)));
                
                if(cnt_end)
                    NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA fully restarted: %u times", cnt_end);
            }
            
            else
            {
                usbd_dma_start(ep);
                
                /*  There is a lot of USBD registers that cannot be accessed during EasyDMA transfer.
                    This is quick fix to maintain stability of the stack.
                    It cost some performance but makes stack stable. */
                while(!nrf_usbd_event_check(nrf_drv_usbd_ep_to_endevent(ep)))
                {
                    /* Empty */
                }
            }
            
            if(NRF_USBD_DMAREQ_PROCESS_DEBUG)
                NRF_LOG_DEBUG("USB DMA process - finishing");
                
            /* Transfer started - exit the loop */
            break;
        }
    }
    
    else
    {
        if(NRF_USBD_DMAREQ_PROCESS_DEBUG)
            NRF_LOG_DEBUG("USB DMA process - EasyDMA busy");
    }
}
/** @} */

typedef void (*nrf_drv_usbd_isr_t)(void);

/**
    @brief USBD interrupt service runtimes

*/
static const nrf_drv_usbd_isr_t m_isr[] =
{
    [USBD_INTEN_USBRESET_Pos   ] = ev_usbreset_handler,
    [USBD_INTEN_STARTED_Pos    ] = ev_started_handler,
    [USBD_INTEN_ENDEPIN0_Pos   ] = ev_dma_epin0_handler,
    [USBD_INTEN_ENDEPIN1_Pos   ] = ev_dma_epin1_handler,
    [USBD_INTEN_ENDEPIN2_Pos   ] = ev_dma_epin2_handler,
    [USBD_INTEN_ENDEPIN3_Pos   ] = ev_dma_epin3_handler,
    [USBD_INTEN_ENDEPIN4_Pos   ] = ev_dma_epin4_handler,
    [USBD_INTEN_ENDEPIN5_Pos   ] = ev_dma_epin5_handler,
    [USBD_INTEN_ENDEPIN6_Pos   ] = ev_dma_epin6_handler,
    [USBD_INTEN_ENDEPIN7_Pos   ] = ev_dma_epin7_handler,
    [USBD_INTEN_EP0DATADONE_Pos] = ev_setup_data_handler,
    [USBD_INTEN_ENDISOIN_Pos   ] = ev_dma_epin8_handler,
    [USBD_INTEN_ENDEPOUT0_Pos  ] = ev_dma_epout0_handler,
    [USBD_INTEN_ENDEPOUT1_Pos  ] = ev_dma_epout1_handler,
    [USBD_INTEN_ENDEPOUT2_Pos  ] = ev_dma_epout2_handler,
    [USBD_INTEN_ENDEPOUT3_Pos  ] = ev_dma_epout3_handler,
    [USBD_INTEN_ENDEPOUT4_Pos  ] = ev_dma_epout4_handler,
    [USBD_INTEN_ENDEPOUT5_Pos  ] = ev_dma_epout5_handler,
    [USBD_INTEN_ENDEPOUT6_Pos  ] = ev_dma_epout6_handler,
    [USBD_INTEN_ENDEPOUT7_Pos  ] = ev_dma_epout7_handler,
    [USBD_INTEN_ENDISOOUT_Pos  ] = ev_dma_epout8_handler,
    [USBD_INTEN_SOF_Pos        ] = ev_sof_handler,
    [USBD_INTEN_USBEVENT_Pos   ] = ev_usbevent_handler,
    [USBD_INTEN_EP0SETUP_Pos   ] = ev_setup_handler,
    [USBD_INTEN_EPDATA_Pos     ] = ev_epdata_handler
};

/**
    @name Interrupt handlers

    @{
*/
void USBD_IRQHandler(void)
{
    const uint32_t enabled = nrf_usbd_int_enable_get();
    uint32_t to_process = enabled;
    uint32_t active = 0;
    
    /* Check all enabled interrupts */
    while(to_process)
    {
        uint8_t event_nr = __CLZ(__RBIT(to_process));
        
        if(nrf_usbd_event_get_and_clear((nrf_usbd_event_t)nrfx_bitpos_to_event(event_nr)))
            active |= 1UL << event_nr;
            
