hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
        to_process &= ~(1UL << event_nr);
    }
    
    if(nrf_drv_usbd_errata_104())
    {
        /* Event correcting */
        if((!m_dma_pending) && (0 != (active & (USBD_INTEN_SOF_Msk))))
        {
            uint8_t usbi, uoi, uii;
            /* Testing */
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
            uii = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            
            if(0 != uii)
                uii &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
                
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
            uoi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            
            if(0 != uoi)
                uoi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
                
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
            usbi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            
            if(0 != usbi)
                usbi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
                
            /* Processing */
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AC;
            uii &= (uint8_t) * ((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            
            if(0 != uii)
            {
                uint8_t rb;
                m_simulated_dataepstatus |= ((uint32_t)uii) << USBD_EPIN_BITPOS_0;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uii;
                rb = (uint8_t) * ((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uii: 0x%.2x (0x%.2x)", uii, rb);
            }
            
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AD;
            uoi &= (uint8_t) * ((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            
            if(0 != uoi)
            {
                uint8_t rb;
                m_simulated_dataepstatus |= ((uint32_t)uoi) << USBD_EPOUT_BITPOS_0;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uoi;
                rb = (uint8_t) * ((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uoi: 0x%.2u (0x%.2x)", uoi, rb);
            }
            
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AE;
            usbi &= (uint8_t) * ((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            
            if(0 != usbi)
            {
                uint8_t rb;
                
                if(usbi & 0x01)
                    active |= USBD_INTEN_EP0SETUP_Msk;
                    
                if(usbi & 0x10)
                    active |= USBD_INTEN_USBRESET_Msk;
                    
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = usbi;
                rb = (uint8_t) * ((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   usbi: 0x%.2u (0x%.2x)", usbi, rb);
            }
            
            if(0 != (m_simulated_dataepstatus &
                     ~((1U << USBD_EPOUT_BITPOS_0) | (1U << USBD_EPIN_BITPOS_0))))
                active |= enabled & NRF_USBD_INT_DATAEP_MASK;
                
            if(0 != (m_simulated_dataepstatus &
                     ((1U << USBD_EPOUT_BITPOS_0) | (1U << USBD_EPIN_BITPOS_0))))
            {
                if(0 != (enabled & NRF_USBD_INT_EP0DATADONE_MASK))
                {
                    m_simulated_dataepstatus &=
                        ~((1U << USBD_EPOUT_BITPOS_0) | (1U << USBD_EPIN_BITPOS_0));
                    active |= NRF_USBD_INT_EP0DATADONE_MASK;
                }
            }
        }
    }
    
    /* Process the active interrupts */
    bool setup_active = 0 != (active & NRF_USBD_INT_EP0SETUP_MASK);
    active &= ~NRF_USBD_INT_EP0SETUP_MASK;
    
    while(active)
    {
        uint8_t event_nr = __CLZ(__RBIT(active));
        m_isr[event_nr]();
        active &= ~(1UL << event_nr);
    }
    
    usbd_dmareq_process();
    
    if(setup_active)
        m_isr[USBD_INTEN_EP0SETUP_Pos]();
}

/** @} */
/** @} */

ret_code_t nrf_drv_usbd_init(nrf_drv_usbd_event_handler_t const event_handler)
{
    ASSERT((nrf_drv_usbd_errata_type_52840_eng_a() ||
            nrf_drv_usbd_errata_type_52840_eng_b() ||
            nrf_drv_usbd_errata_type_52840_eng_c() ||
            nrf_drv_usbd_errata_type_52840_eng_d())
          );
          
    if(NULL == event_handler)
        return NRF_ERROR_INVALID_PARAM;
        
    if(m_drv_state != NRFX_DRV_STATE_UNINITIALIZED)
        return NRF_ERROR_INVALID_STATE;
        
    m_event_handler = event_handler;
    m_drv_state = NRFX_DRV_STATE_INITIALIZED;
    
    uint8_t n;
    
    for(n = 0; n < NRF_USBD_EPIN_CNT; ++n)
    {
        nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPIN(n);
        nrf_drv_usbd_ep_max_packet_size_set(ep, NRF_USBD_EPISO_CHECK(ep) ?
                                            (NRF_DRV_USBD_ISOSIZE / 2) : NRF_DRV_USBD_EPSIZE);
        usbd_drv_ep_state_t *p_state = ep_state_access(ep);
        p_state->status = NRF_USBD_EP_OK;
        p_state->handler.feeder = NULL;
        p_state->transfer_cnt = 0;
    }
    
    for(n = 0; n < NRF_USBD_EPOUT_CNT; ++n)
    {
        nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPOUT(n);
        nrf_drv_usbd_ep_max_packet_size_set(ep, NRF_USBD_EPISO_CHECK(ep) ?
                                            (NRF_DRV_USBD_ISOSIZE / 2) : NRF_DRV_USBD_EPSIZE);
        usbd_drv_ep_state_t *p_state = ep_state_access(ep);
        p_state->status = NRF_USBD_EP_OK;
        p_state->handler.consumer = NULL;
        p_state->transfer_cnt = 0;
    }
    
    return NRF_SUCCESS;
}

ret_code_t nrf_drv_usbd_uninit(void)
{
    if(m_drv_state != NRFX_DRV_STATE_INITIALIZED)
        return NRF_ERROR_INVALID_STATE;
        
    m_event_handler = NULL;
    m_drv_state = NRFX_DRV_STATE_UNINITIALIZED;
    return NRF_SUCCESS;
}

