hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.c
void nrf_drv_usbd_enable(void)
{
    ASSERT(m_drv_state == NRFX_DRV_STATE_INITIALIZED);
    
    /* Prepare for READY event receiving */
    nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);
    
    if(nrf_drv_usbd_errata_187())
    {
        CRITICAL_REGION_ENTER();
        
        if(*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
            *((volatile uint32_t *)(0x4006ED14)) = 0x00000003;
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
        
        else
            *((volatile uint32_t *)(0x4006ED14)) = 0x00000003;
            
        CRITICAL_REGION_EXIT();
    }
    
    if(nrf_drv_usbd_errata_171())
    {
        CRITICAL_REGION_ENTER();
        
        if(*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
            *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
        
        else
            *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
            
        CRITICAL_REGION_EXIT();
    }
    
    /* Enable the peripheral */
    nrf_usbd_enable();
    
    /* Waiting for peripheral to enable, this should take a few us */
    while(0 == (NRF_USBD_EVENTCAUSE_READY_MASK & nrf_usbd_eventcause_get()))
    {
        /* Empty loop */
    }
    
    nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);
    
    if(nrf_drv_usbd_errata_171())
    {
        CRITICAL_REGION_ENTER();
        
        if(*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
            *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
        
        else
            *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
            
        CRITICAL_REGION_EXIT();
    }
    
    if(nrf_drv_usbd_errata_166())
    {
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7E3;
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = 0x40;
        __ISB();
        __DSB();
    }
    
    nrf_usbd_isosplit_set(NRF_USBD_ISOSPLIT_Half);
    
    if(USBD_CONFIG_ISO_IN_ZLP)
        nrf_drv_usbd_isoinconfig_set(NRF_USBD_ISOINCONFIG_ZERODATA);
        
    else
        nrf_drv_usbd_isoinconfig_set(NRF_USBD_ISOINCONFIG_NORESP);
        
    m_ep_ready = (((1U << NRF_USBD_EPIN_CNT) - 1U) << USBD_EPIN_BITPOS_0);
    m_ep_dma_waiting = 0;
    usbd_dma_pending_clear();
    m_last_setup_dir = NRF_DRV_USBD_EPOUT0;
    
    m_drv_state = NRFX_DRV_STATE_POWERED_ON;
}

void nrf_drv_usbd_disable(void)
{
    ASSERT(m_drv_state != NRFX_DRV_STATE_UNINITIALIZED);
    
    /* Stop just in case */
    nrf_drv_usbd_stop();
    
    /* Disable all parts */
    nrf_usbd_int_disable(nrf_usbd_int_enable_get());
    nrf_usbd_disable();
    usbd_dma_pending_clear();
    m_drv_state = NRFX_DRV_STATE_INITIALIZED;
    
    if(nrf_drv_usbd_errata_187())
    {
        CRITICAL_REGION_ENTER();
        
        if(*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
            *((volatile uint32_t *)(0x4006ED14)) = 0x00000000;
            *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
        
        else
            *((volatile uint32_t *)(0x4006ED14)) = 0x00000000;
            
        CRITICAL_REGION_EXIT();
    }
}

void nrf_drv_usbd_start(bool enable_sof)
{
    ASSERT(m_drv_state == NRFX_DRV_STATE_POWERED_ON);
    m_bus_suspend = false;
    
    uint32_t ints_to_enable =
        NRF_USBD_INT_USBRESET_MASK     |
        NRF_USBD_INT_STARTED_MASK      |
        NRF_USBD_INT_ENDEPIN0_MASK     |
        NRF_USBD_INT_EP0DATADONE_MASK  |
        NRF_USBD_INT_ENDEPOUT0_MASK    |
        NRF_USBD_INT_USBEVENT_MASK     |
        NRF_USBD_INT_EP0SETUP_MASK     |
        NRF_USBD_INT_DATAEP_MASK;
        
    if(enable_sof || nrf_drv_usbd_errata_104())
        ints_to_enable |= NRF_USBD_INT_SOF_MASK;
        
    /* Enable all required interrupts */
    nrf_usbd_int_enable(ints_to_enable);
    
    /* Enable interrupt globally */
    NRFX_IRQ_PRIORITY_SET(USBD_IRQn, USBD_CONFIG_IRQ_PRIORITY);
    NRFX_IRQ_ENABLE(USBD_IRQn);
    
    /* Enable pullups */
    nrf_usbd_pullup_enable();
}

void nrf_drv_usbd_stop(void)
{
    ASSERT(m_drv_state == NRFX_DRV_STATE_POWERED_ON);
    
    if(NRFX_IRQ_IS_ENABLED(USBD_IRQn))
    {
        /* Abort transfers */
        usbd_ep_abort_all();
        
        /* Disable pullups */
        nrf_usbd_pullup_disable();
        
        /* Disable interrupt globally */
        NRFX_IRQ_DISABLE(USBD_IRQn);
        
        /* Disable all interrupts */
        nrf_usbd_int_disable(~0U);
    }
}

bool nrf_drv_usbd_is_initialized(void)
{
    return (m_drv_state >= NRFX_DRV_STATE_INITIALIZED);
}

bool nrf_drv_usbd_is_enabled(void)
{
    return (m_drv_state >= NRFX_DRV_STATE_POWERED_ON);
}

bool nrf_drv_usbd_is_started(void)
{
    return (nrf_drv_usbd_is_enabled() && NRFX_IRQ_IS_ENABLED(USBD_IRQn));
}

bool nrf_drv_usbd_suspend(void)
{
    bool suspended = false;
    
    CRITICAL_REGION_ENTER();
    
    if(m_bus_suspend)
    {
        usbd_ep_abort_all();
        
        if(!(nrf_usbd_eventcause_get() & NRF_USBD_EVENTCAUSE_RESUME_MASK))
        {
            nrf_usbd_lowpower_enable();
            
            if(nrf_usbd_eventcause_get() & NRF_USBD_EVENTCAUSE_RESUME_MASK)
                nrf_usbd_lowpower_disable();
                
            else
            {
                suspended = true;
                
                if(nrf_drv_usbd_errata_171())
                {
                    if(*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
                    {
                        *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
                        *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
                        *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
                    }
                    
                    else
                        *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
                }
            }
        }
    }
    
